; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v4 - type_2 ?v5 - type_1)
 	      (pred_1 ?v7 - object ?v5 - type_1)
	      (pred_4 ?v4 - type_2 ?v3 - type_3)
	      (pred_2 ?v4 - type_2 ?v7 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v1 ?v2 - type_1)
       :precondition (and  (pred_3 ?v4 ?v1))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_2 ?v8 - object ?v6 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v6) (pred_3 ?v4 ?v6) (pred_4 ?v4 ?v3))
       :effect (and (pred_2 ?v4 ?v8 ?v3)
		    (not (pred_1 ?v8 ?v6)) 
		    (not (pred_4 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_2 ?v8 - object ?v6 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v8 ?v3) (pred_3 ?v4 ?v6))
       :effect (and (pred_1 ?v8 ?v6)
		    (pred_4 ?v4 ?v3)
		    (not (pred_2 ?v4 ?v8 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_14 obj_13 - type_2
obj_02 obj_05 obj_03 obj_08 - type_3
obj_10 obj_06 obj_01 obj_09 - type_1
obj_11 obj_04 obj_12 obj_07 - object)
(:init
(pred_3 obj_14 obj_10)
(pred_4 obj_14 obj_02)
(pred_4 obj_14 obj_05)
(pred_3 obj_13 obj_09)
(pred_4 obj_13 obj_03)
(pred_4 obj_13 obj_08)
(pred_1 obj_11 obj_09)
(pred_1 obj_04 obj_10)
(pred_1 obj_12 obj_10)
(pred_1 obj_07 obj_09)
)
(:goal
(and
(pred_1 obj_11 obj_09)
(pred_1 obj_04 obj_01)
(pred_1 obj_12 obj_01)
(pred_1 obj_07 obj_09)
)
)

(:constraints
  (always (not (pred_3 obj_14 obj_01)))
)
)

; plan
1. (op_2 obj_14 obj_04 obj_10 obj_05)
   deleted: (pred_1 obj_04 obj_10) (pred_4 obj_14 obj_05)
   added: (pred_2 obj_14 obj_04 obj_05)
   goals met: 2 of 4
2. (op_3 obj_13 obj_09 obj_10)
   deleted: (pred_3 obj_13 obj_09)
   added: (pred_3 obj_13 obj_10)
   goals met: 2 of 4
3. (op_2 obj_13 obj_12 obj_10 obj_08)
   deleted: (pred_1 obj_12 obj_10) (pred_4 obj_13 obj_08)
   added: (pred_2 obj_13 obj_12 obj_08)
   goals met: 2 of 4
4. (op_3 obj_13 obj_10 obj_01)
   deleted: (pred_3 obj_13 obj_10)
   added: (pred_3 obj_13 obj_01)
   goals met: 2 of 4
5. (op_1 obj_13 obj_12 obj_01 obj_08)
   deleted: (pred_2 obj_13 obj_12 obj_08)
   added: (pred_1 obj_12 obj_01) (pred_4 obj_13 obj_08)
   goals met: 3 of 4
6. (op_3 obj_13 obj_01 obj_10)
   deleted: (pred_3 obj_13 obj_01)
   added: (pred_3 obj_13 obj_10)
   goals met: 3 of 4
7. (op_1 obj_14 obj_04 obj_10 obj_05)
   deleted: (pred_2 obj_14 obj_04 obj_05)
   added: (pred_1 obj_04 obj_10) (pred_4 obj_14 obj_05)
   goals met: 3 of 4
8. (op_2 obj_13 obj_04 obj_10 obj_08)
   deleted: (pred_1 obj_04 obj_10) (pred_4 obj_13 obj_08)
   added: (pred_2 obj_13 obj_04 obj_08)
   goals met: 3 of 4
9. (op_3 obj_13 obj_10 obj_01)
   deleted: (pred_3 obj_13 obj_10)
   added: (pred_3 obj_13 obj_01)
   goals met: 3 of 4
10. (op_1 obj_13 obj_04 obj_01 obj_08)
   deleted: (pred_2 obj_13 obj_04 obj_08)
   added: (pred_1 obj_04 obj_01) (pred_4 obj_13 obj_08)
   goals met: 4 of 4
